app/controllers/league_controller.rb

  def list
      @aleagues = League.order :id
---
SELECT `leagues`.* FROM `leagues` ORDER BY `leagues`.`id` ASC

  def create
      values = params.require(:league).permit :playerhost, :leaguename, :player1, :player2, :player3, :player4, :player5, :player6, :player7, :player8, :player9, :player10, :player11, :player12, :player13, :player14, :player15
      @league = League.new values
      if @league.save
---
INSERT INTO `leagues` (`leaguename`, `playerhost`, `player1`, `player2`, `player3`, `player4`, `player5`, `player6`, `player7`, `player8`, `player9`, `player10`, `player11`, `player12`, `player13`, `player14`, `player15`, `created_at`, `updated_at`) VALUES ('new', 'mt', '', '', '', 'ffffffffffffffffffffffff', '', '', '', '', '', '', '', '', '', '', '', '2018-08-25 08:35:04', '2018-08-25 08:35:04')

  def destroy
      id = params[:id]
      League.destroy id
---
DELETE FROM `leagues` WHERE `leagues`.`id` = 13